Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Compliance considerations in relation to source code modifications, notices, distribution, software design, usage, linkages, and code mixing.
ja: ソース コード改変、告知、頒布、ソフトウェア設計、利用、リンク、コード結合など関連したコンプライアンスについての考察。

source: Compliance end-to-end management process
ja: コンプライアンス一貫管理プロセス

source: Compliance inquiries can include requests for:
ja: コンプライアンスに関する照会は、以下の要求も含まれます。

source: Compliance is verified on a product-by-product, service-by-service basis: Just because an open source package is approved for use in one context does not necessarily mean it will be approved for use in a second one.
ja: コンプライアンスは製品ごとサービスごとに検証されます。というのは、オープン ソース パッケージは、ある条件での利用を承認されたのであり、2次利用について承認されたわけではないからです。

source: Compliance office ensures that there are no open issues in the architecture and linkage analyses.
ja: コンプライアンス オフィサーは、アーキテクチャー解析、リンク解析において未解決の課題がないことを確認します。

source: Compliance policies and processes govern the various aspects of using, contributing, auditing, and distribution of open source software.
ja: コンプライアンス ポリシーとプロセスがオープンソース ソフトウェアの様々な側面、利用、寄付、監査、配布を取り仕切ります。

source: Compliance ticket is closed only if no open subtasks are attached to it
ja: チケットのクローズは、関連するサブのタスクが存在しない時のみとする

source: Compliance violations reported to the executive team
ja: 経営チームへ報告されたコンプライアンス違反

source: Comply with open source licensing obligations.
ja: ライセンス上の義務に従う

source: Comply with third-party software supplier contractual obligations.
ja: サードパーティとの契約上の義務に従う

source: Component dependencies
ja: コンポーネントの依存状態

source: Component dependencies .
ja: コンポーネントの依存状態

source: Component has been approved for usage, it has been registered in the software inventory, and all notices have been captured and sent for fulfillment.
ja: コンポーネントは利用が承認され、ソフトウェア一覧表に登録され、全ての通知が収集され義務履行のために送付されている。

source: Component run-time context (kernel/drivers/modules, middleware, libraries, applications, etc.)
ja: コンポーネントの実行時のコンテキスト(Kernel/dirver/modules, middleware, libraries, applications, etc.)

source: Component run-time context (kernel/drivers/modules, middleware, libraries, applications, etc.) .
ja: コンポーネントの実行時のコンテキスト(Kernel/dirver/modules, middleware, libraries, applications, etc.) .

source: Components deployed in kernel space (drivers, etc.) versus user space (libraries, middleware, applications)
ja: カーネル空間実行（ドライバ等）とユーザー空間実行（ライブラリ、ミドルウェア、アプリケーション）

source: Components deployed in kernel space (drivers, etc.) versus user space (libraries, middleware, applications) .
ja: カーネル空間実行（ドライバ等）とユーザー空間実行（ライブラリ、ミドルウェア、アプリケーション）.

source: Components originating from third-party software providers (both open source and proprietary)
ja: サード パーティ プロバイダから提供されたものに由来するコンポーネント

source: Components originating from third-party software providers (both open source and proprietary) .
ja: サード パーティ プロバイダから提供されたものに由来するコンポーネント .

source: Components originating from third-party software providers .
ja: サード パーティ ソフトウェア プロバイダー由来のコンポーネント

source: Components that are open source (used as-is or modified) .
ja: オープン ソース コンポーネント（そのまま利用、または変更利用）

source: Components that are open source (used “as is” or modified) .
ja: （そのまま、または変更して利用される）オープン ソースからなるコンポーネント

source: Components that use shared header files
ja: 共有されたヘッダファイルを使用するコンポーネント

source: Components that use shared header files .
ja: 共有されたヘッダファイルを使用するコンポーネント

source: Components that were included in the software BOM that don’t have a corresponding approval
ja: ソフトウェアBOMに含まれているが、承認を受けていないコンポーネント

source: Components that were included in the software BOM that don’t have a corresponding approval .
ja: ソフトウェアBOMに含まれているが、承認を受けていないコンポーネント

source: Compute a line-by-line diff of the source code in changed software components, and decide if you want to scan the source code again or rely on the previous scan.
ja: 変更されたソフトウェア コンポーネントのソース コードの差異を計測し、再度ソース コードをスキャンするか、あるいは前のスキャンは信頼に足るものかを、決定します。

source: Conduct design reviews: Engineering teams should continuously conduct design reviews to discover and remedy any compliance issues in a timely manner.
ja: 設計のレビュー：エンジニアリングチームは継続的に設計をレビューし、コンプライアンス問題をタイムリーに発見し救済策を講じるべきです。

source: Conduct design, architecture, and code reviews
ja: 設計、アーキテクチャ、コードのレビューの実施

source: Conduct design, architecture, and code reviews Prepare software packages for distribution
ja: 設計、アーキテクチャ、コードのレビューの実施 配布のためのソフトウェアパッケージ準備

source: Conduct periodic full scans of software platform to detect any OS not corresponding to a given approval form.
ja: 定期的にソフトウェア プラットフォーム の全スキャンを行い、承認された型に該当しないオープンソースを検出。

source: Conduct periodic source code scans
ja: ソースコードを定期的にスキャン

source: Conduct periodic source code scans Ensure that auditing is a milestone in the iterative development process Provide proper level of staffing so as not to fall behind in the audit schedule
ja: ソースコードを定期的にスキャン 繰り返される開発プロセスのマイルストーンに監査を確かに入れ込む 適切なレベルのスタッフを揃え、監査がスケジュール遅れとならないようにす

source: Conduct regular code scans of all project source code for unexpected licenses or code snippets.
ja: 予期されないライセンスやコードのスニペットのため、定期的にプロジェクトの全ソースコードをスキャン

source: Conduct regular source code inspections
ja: ソースコードを定期的に検査

source: Conduct source code inspections before releasing the source code
ja: ソースコードのリリース前に検査

source: Conduct source code inspections before releasing the source code Add milestone in compliance process to verify modified source code has been marked as such
ja: ソースコードのリリース前に検査 変更されたソースコードが適切にマークされていることを、コンプライアンスプロセス上のマイルストーンとする

source: Configure to match company policy preferences to flag linkages that violate those policies (e.g., linking with GPL-licensed code)
ja: （GPLで許諾されたコードとのリンクなど）方針から逸脱しているリンクにフラグを付け、企業方針と合うように構成します。

source: Confirm that all contents of the source code package have been reviewed by Engineering and confirmed by OSRB.
ja: ソース コード パッケージに含まれている全ての内容物は、技術担当によってレビューされ、OSRBによって確認されていることを、確認します。

source: Confirm the origin(s) of the source code, including the provenance of any open source .
ja: オープン ソースの由来も含めて、ソース コードの由来を確認します。

source: Connect with license scanning tools or consume the output thereof
ja: ライセンス スキャン ツールと接続します。

source: Connect with license scanning tools or consume the output thereof .
ja: ライセンス スキャン ツールと接続します。または、出力を使います。.

source: Consequences of not using the software
ja: ソフトウェアを利用しないことによって発生すること

source: Consider how your existing open source compliance efforts would measure up in an enforcement action, and work to improve your processes.
ja: オープン ソース コンプライアンスに対して努力することは、ライセンス強制を受けた時にいかに役立ち、自社プロセスをいかに改善するかを考えてみて下さい。

source: Consult with Legal
ja: 法務に相談する

source: Contacts in the key open source project communities .
ja: 重要なオープンソース プロジェクトのコミュニティとの人脈

source: Contacts in the open source organizations such as the Linux Foundation, Apache Foundation, Mozilla Foundation, Software Freedom Law Center, etc.
ja: The Linux Foundation, Apache Foundation, Mozilla Foundation, Software Freedom Law Center (ソフトウェアの自由のための法律センター) などのオープンソースの団体との人脈

source: Contents
ja: 目次

source: Continual scans on the source code base, including that received from third-party software providers, to intercept source code that was checked into the code base without a corresponding compliance ticket.
ja: ソースコードのベースを継続的にスキャン。これにはサードパーティのソフトウェア プロバイダから受領したものを含めます。該当するコンプライアンス チケットなしにコードベースにチェックインしたソースコードを捕まえるためです。

source: Continuous audits of all source code integrated in the code base, regardless of its origins
ja: コードベースに統合されたすべてのソースコードについて、出所を問わず継続的に監査

source: Continuous audits of all source code integrated in the code base, regardless of its origins .
ja: コードベースに統合されたすべてのソースコードについて、出所を問わず継続的に監査

source: Continuous automated source code based on a predefined interval of time for all source code.
ja: 自動化されたソースコードのスキャン を継続的に、事前設定した時間間隔で全ソースコードに対して 実行

source: Continuous improvements to the tools used in ensuring compliance and automating as much of the process as possible to ensure high efficiency in executing the compliance program
ja: コンプライアンスや自動化に使われるツールを継続的に改善し、コンプライアンス プログラムにおいて可能な限り多くのプロセスを高い効率で実行

source: Contribute to and approve training
ja: トレーニングの提供と承認

source: Contribute to and approve training Contribute to improving the OS compliance program
ja: トレーニングの提供と承認 オープンソースコンプライアンスプログラム改善への貢献

source: Contribute to compliance and OS training
ja: コンプライアンスとオープンソースのトレーニングに寄与

source: Contribute to compliance and OS training Contribute to improving compliance program
ja: コンプライアンスとオープンソースのトレーニングに寄与 コンプライアンスプログラムの改善に寄与

source: Contribute to creation of new tools to facilitate automation, discovery of OS in dev environment
ja: 自動化や、開発環境の中にオープンソースのコードを見つける新たなツール作成に寄与

source: Contribute to improving compliance program
ja: コンプライアンス プログラムの改善に寄与

source: Contribute to improving the OS compliance program
ja: オープンソース コンプライアンス プログラム改善への貢献

source: Contribute to improving the compliance program
ja: コンプライアンスプログラムの改善に貢献

source: Contribute to the startup and ongoing management of the open source compliance program
ja: オープンソース コンプライアンス プログラムの立ち上げと継続に貢献

source: Contributing modifications to an existing open source project
ja: 既存のオープン ソース プロジェクトへの修正の貢献

source: Conversely, compliance can demonstrate the costs and risks associated with using open source components, as they will go through multiple rounds of review.
ja: また逆に、レビューを繰り返すことを通じてコンプライアンスは、オープンソースのコンポーネントの利用に伴うコストやリスクを示すことにもなります。

source: Cooperate with OSRB: Engineering teams must respond promptly to questions asked by the OSRB and cooperate in resolving compliance tickets.
ja: OSRBとの協力：エンジニアリング チームはOSRBからの質問に迅速に回答し、コンプライアンス チケットを解決するのに協力しなければなりません。

source: Coordinate distribution of source code packages
ja: ソースコード パッケージの配布を調整

source: Coordinate source code distribution of open source packages (when stipulated by licenses) with engineering and product teams, including preparing and verifying a distribution checklist for each open source package
ja: オープンソースのパッケージのソースコード配布（ライセンスに規定されている場合）についてエンジニアリングおよび製品チームと調整します。これは個々のオープンソース パッケージの配布チェックリストの用意と確認を含みます。

source: Coordinate source code distribution of open source packages (when stipulated by licenses) with engineering and product teams, including preparing and verifying a distribution checklist for each open source package .
ja: オープンソースのパッケージのソースコード配布（ライセンスに規定されている場合）についてエンジニアリングおよび製品チームと調整します。これは個々のオープンソースパッケージの配布チェックリストの用意と確認を含みます。

source: Coordinate source code scans and audits
ja: ソースコードのスキャンと監査を調整

source: Coordinate source code scans and drive all auditing issues to closure
ja: ソースコードのスキャン作業を調整し、すべての監査を終わりまで主導する

source: Coordinate source code scans and drive all auditing issues to closure .
ja: ソースコードのスキャン作業を調整し、すべての監査を終わりまで主導する

source: Copies of the license information attached to the ticket: Typically, the compliance officer attaches the README, COPYING, and AUTHORS files available in the source code packages to the compliance ticket.
ja: チケットに付けられたライセンス情報のコピー：通常、コンプライアンス オフィサーは、ソース コード パッケージに含まれているREADME, COPYING, AUTHORSなどのファイルをコンプライアンス チケットに付与します。

source: Copy/Paste
ja: コピー／ペースト

source: Copyright Notices
ja: 著作権表記

source: Corporate Development
ja: 企業買収

source: Corporate Development Request open source compliance be completed before a merger or acquisition Request open source compliance be completed when receiving source code from outsourced development centers or third-party software vendors
ja: 企業買収 会社の合併や吸収買収に先立ちオープンソースコンプライアンスが完了するよう要請 外部委託した開発会ハウセンター、またはサードパーティのソフトウェアベンダーからソースコードを受領するに先立ちオープンソースコンプライアンスが完了するよう要請

source: Corporate Development is also involved with compliance in transactions such as spin-offs and joint ventures.
ja: 企業買収部門はスピンオフやジョイント ベンチャーのコンプライアンスにも関わります。

source: Corporate Development is involved with open source compliance in two major scenarios: mergers and acquisitions transactions, and outsourced development.
ja: 企業買収部門はオープンソースのコンプライアンスに主に二つの流れで関わります。買収と吸収合併、および開発の外部委託です

source: Corporate Development must mandate that all source code received from outsourced development centers must go through the compliance process to discover all open source being used and to ensure proper actions to fulfill license obligations.
ja: 企業買収部門は外部の開発センターから受領したソースコード全てがコンプライアンスプロセスを通り、利用されたオープンソースが全て発見されライセンス上の義務を満たすため適切な行動が確かに取られるよう命令しなければなりません。

source: Corporate Development must mandate that source code be evaluated from a compliance perspective prior to any merger or acquisition to avoid surprises that might derail discussions or affect the company’s valuation.
ja: 企業買収部門は合併や買収に先立ちソースコードをコンプライアンスの観点から評価し、議論を脱線させたり企業価値を変えたりする不測の事態が起きないよう命令しなければなりません。

source: Country
ja: 国名

source: Course completion .
ja: トレーニングコース修了

source: Create a final audit report and ensure that all identified issues have been closed
ja: 最終監査報告書を作成し、特定されたすべての問題が解決されたことを確実にする

source: Create and maintain compliance policies, processes, guidelines, templates, and forms used in the compliance program.
ja: コンプライアンス プログラムで使われるコンプライアンス ポリシー、プロセス、ガイドライン、テンプレート、フォームを作成し保守

source: Create and/or acquire new tools based on OSRB requests
ja: OSRBの要請に応じ、新しいツールを作成、入手

source: Creating a Compliance Program
ja: コンプライアンス プログラムの作成

source: Creating a Compliance Program The first challenge is to balance the compliance program and its supporting infrastructure with (existing) internal processes while meeting deadlines to ship products and launch services.
ja: コンプライアンスプログラムの作成 最初の難しさは、コンプライアンスプログラムやそれを支える（既存の）内部手続きのためのインフラと、製品出荷やサービス開始の〆切とのバランスを取ることです。

source: Creating a new open source project
ja: 新しいオープン ソース プロジェクトの設立

source: Customers who buy the product or use the service containing open source software are informed of their rights to receive the source code when applicable
ja: オープン ソース ソフトウェアを含む製品を購入する顧客やサービスを利用するユーザは、適用可能な場合に、ソース コードを受け取る権利があることを通知される。

source: Customers who buy the product or use the service containing open source software are informed of their rights to receive the source code when applicable .
ja: オープン ソース ソフトウェアを含む製品を購入する顧客やサービスを利用するユーザは、適用可能な場合に、ソース コードを受け取る権利があることを通知される。

source: DETAILED USAGE PROCESS
ja: 詳細な利用プロセス

source: DETAILED USAGE PROCESS 88
ja: 詳細な利用プロセス 88

source: DISTRIBUTION CONSIDERATIONS
ja: 頒布に関する考察

source: DISTRIBUTION CONSIDERATIONS 129
ja: 頒布に関する考察 129

source: DOCUMENTATION
ja: 文書化

source: DOCUMENTATION The documentation team is responsible for including written offers and any appropriate open source notices in the product documentation.
ja: 文書化 文書化チームは、ソースコードを得る方法についての 書面での告知や、製品に添付するオープンソースの通告すべてについて責任を持ちます。

source: DOCUMENTATION 58
ja: 文書化 58

source: Damage to brand, reputation, and credibility
ja: ブランドや評判、信頼性へのダメージ

source: Decide on distribution method and mode.
ja: 頒布方法と様式を決定します

source: Deciding on a distribution mode
ja: 頒布様式を決めます。

source: Deciding on a distribution mode .
ja: 頒布様式を決めます。

source: Deciding on the source code supply method .
ja: ソース コード提供方法を決めます。

source: Dependencies
ja: 依存関係

source: Dependencies .
ja: 依存関係

source: Depending on the form and format of the bill of materials, it is possible to use command-line diff tools, productivity tools (spreadsheets, etc.), directory comparison tools, and reports from build and continuous integration tools, plus scripting “glue,” to create web-based BOM version comparisons.
ja: BOMのフォーマットにも依存しますが、ウェブベースでBOMバージョン比較を作成するために、コマンドラインのdiffツールや、生産性ツール(spreadsheets等)や、ディレクトリ比較ツール、ビルドや連続統合ツールからの報告に加えて、これらを結合するスクリプトを利用することが可能です。

source: Depending on the size of the company and the extent to which open source is included in its commercial offerings, the company can mandate that employees working with open source take formal instructor-led courses, possibly culminating in actual exams.
ja: 企業の規模やオープンソースの営利活動への浸透度合いに応じて、企業はオープンソースに携わる従業員に公式の講師によるトレーニングコースを命じることができます。実例でのトレーニングがその頂点となりえます。

source: Depending on the size of the organization and the extent to which open source is used in commercial offerings, the organization can mandate that employees working with open source take formal instructor-led courses and be tested on their subject-matter proficiency.
ja: 組織の規模や、オープン ソースが商品に使われている範囲にもよりますが、組織は、オープン ソースに携わる従業員が公式な講師の教えるコースを受講し、その領域での習熟度のテストを受けるように命じることができます。

source: Depending on the size of the organization, auditing responsibilities can be assigned to the OSRB or to an independent team (auditing team) that reports to the Compliance Officer.
ja: 監査はOSRBか独立した監査チームかが組織の規模に応じて責任を持ち、コンプライアンスオフィサーに報告します。

source: Deprecated/removed open source .
ja: 評価が下がった／使われなくなったオープン ソース

source: Description
ja: 説明

source: Develop and offer open source and compliance training: The OSRB drives the development of open source and compliance training to ensure that employees have a good understanding of the company’s open source policies and compliance practices.
ja: オープンソースとコンプライアンスの訓練を開発し提供。OSRBはオープンソースとコンプライアンスの訓練の開発を主導し、従業員が企業のオープンソースのポリシーやコンプライアンスのプロセスについて良く理解するようにします。

source: Develop community involvement policy, process, procedures, and guidelines.
ja: コミュニティに関与するポリシー、プロセス、手続き、ガイドラインを策定。

source: Develop open source use and distribution policies and procedures
ja: オープンソースの利用および配布のポリシーと手続きを定める

source: Develop open source use and distribution policies and procedures .
ja: オープンソースの利用および配布のポリシーと手続きを定めます

source: Developers did not leave comments about future products, product code names, mention of competitors, or any inappropriate comments
ja: 開発者は、将来の製品、製品開発コード名、競合他社への言及、その他不適切なコメントを残していない。

source: Developers fill out the online form requesting approval to use a given open source component.
ja: 開発者は、該当するオープン ソース コンポーネントの利用の承認を要求するオンライン フォームを記入します。

source: Developers who wish to use or contribute to open source software will be requested to submit online requests and get proper approvals.
ja: オープンソース ソフトウェアを使いたい、寄付したい開発者はオンラインで申請し、適切な承認を得る必要です。

source: Development in kernel space versus user space (on Linux), especially with whole-platform development in embedded environments
ja: カーネル空間とユーザー空間のどちらで開発を行うか（Linuxの場合）、特に組み込み環境においてプラットフォーム全体を開発する時

source: Development in kernel space versus user space (on Linux), especially with whole-platform development in embedded environments .
ja: カーネル空間とユーザー空間のどちらで開発を行うか（Linuxの場合）、特に組み込み環境においてプラットフォーム全体を開発する時

source: Diligence practices should be updated to require open source disclosure and include guidance regarding the review of any disclosed open source and licenses.
ja: 精査の実務はオープンソースについての開示、開示されたオープンソースとライセンスの評価のガイドを含むよう改める必要があります。

source: Discovery and diligence costs in response to the compliance inquiry, where the company had to investigate the alleged inquiry and perform due diligence on the source code in question
ja: コンプライアンスの照会への対応と発見と精査のコスト。企業は申し立てに応じて、調査とソースコードの精査を実施しなければなりません。

source: Discovery and diligence costs in response to the compliance inquiry, where the company had to investigate the alleged inquiry and perform due diligence on the source code in question .
ja: コンプライアンスの照会への対応として申し立てに応じた調査、問題のソースコードのデューデリジェンス、のためのディスカバリとデューデリジェンスのコスト .

source: Discovery of an open source being used (without proper authorization) via a platform scan
ja: プラットフォーム スキャンによって（適切な承認なしに）利用されているオープン ソースの発覚

source: Discovery of an open source being used as part of third party software
ja: サード パーティ ソフトウェアの一部として利用されているオープン ソースの発覚

source: Display the open source notices on the product itself.
ja: 製品自体にオープン ソース通知を表示します。

source: Distributed as part of a product
ja: 製品の一部として出荷

source: Distributing source code packages
ja: ソース コード パッケージの頒布

source: Distributing source code packages 10.
ja: ソース コード パッケージの頒布 10.

source: Distribution
ja: 頒布

source: Distribution 76
ja: 頒布 76

source: Distribution Checklists
ja: 頒布チェックリスト

source: Distribution Checklists 104
ja: 頒布チェックリスト 104

source: Distribution Incentives
ja: 頒布の動機

source: Distribution Incentives There are three major business incentives to distribute open source code: Meeting license obligations, contributing enhancements to an open source project, and creating and contributing code to a new open source project.
ja: 頒布の動機 オープン ソース コードを頒布することには主に3つのビジネス上の動機があります。

source: Distribution Incentives 100
ja: 頒布の動機 100

source: Distribution Methods and Modes
ja: 頒布方法と様式

source: Distribution Methods and Modes 103
ja: 頒布方法と様式 103

source: Distribution Policy and Process
ja: 頒布プロセスとポリシー

source: Distribution Policy and Process 101
ja: 頒布プロセスとポリシー 101

source: Distribution phase outcome
ja: 頒布フェーズの結果

source: Distribution phase outcome The source code of the component in question is uploaded to the website for distribution (if that is the distribution method of choice).
ja: 頒布フェーズの結果 対象のコンポーネントのソース コードは、頒布用のウェブサイトにアップロードされる。（そういう頒布方法が選択された場合）

source: Distribution phase prerequisite
ja: 頒布フェーズの前提条件

source: Do not leave any inappropriate comments in the source code, such as private comments, product code names, mention of competitors, etc.
ja: 個人的なコメント、製品コード名、競合社への言及など、不適切なコメントをソース コードに残してはいけません。

source: Do not leave inappropriate comments in the source code (private comments, product code names, mention of competitors, etc.).
ja: ソース コードに不適切なコメントを残さないようにします。（個人的なコメント、商品コード名、競合他社名等）

source: Do not remove or in any way disturb existing copyrights or other licensing information from any open source components that you use.
ja: 既存の著作権やライセンスの情報をオープン ソース コンポーネントから削除あるいは変更しないようにします。

source: Do not remove or in any way disturb existing open source licensing copyrights or other licensing information from any open source components that you use.
ja: 既存のオープン ソースライセンス著作権や他のライセンス情報を、利用するオープン ソース コンポーネントから取り除いたり、他のいかなる方法でも手を入れてはいけません。

source: Document the URL from which you downloaded the open source package in addition to saving an original copy of the downloaded package.
ja: ダウンロードしたパッケージを保存するのに加えて、オープン ソース パッケージをダウンロードしたURLも文書化します。

source: Documentation
ja: 文書作成

source: Documentation Include open source license information and notices in the product documentation
ja: 文書作成 オープンソースライセンスの情報と告知を製品の文書の中に含めます

source: Don’t allow compliance tickets to be resolved if audit report isn’t finalized.
ja: 監査レポートが完結しない限りコンプライアンスチケットをクローズ させない。

source: Drive all compliance activities
ja: 全てのコンプライアンス活動を推進

source: Drive all compliance activities Coordinate source code scans and audits Coordinate distribution of source code packages
ja: 全てのコンプライアンス活動を推進 ソースコードのスキャンと監査を調整 ソースコードパッケージの配布を調整

source: Drive the compliance due diligence end-to-end process and act as the compliance program manager, ensuring all compliance-related tasks are addressed and there are no compliance issues blocking products from shipping
ja: コンプライアンスのエンドツーエンド (端から端まで) のデューデリジェンスプロセスを主導し、コンプライアンスプログラムの管理者として、コンプライアンスに関連する全ての業務が適切に認識され製品出荷を妨げるコンプライアンス上の問題が存在しないようにする

source: During legal review, the legal counsel will need to decide on the incoming and outgoing license(s):
ja: 法務レビュー期間に、法務担当は出るライセンスと入るライセンスを決める必要があります。

source: Dynamic and static linkage analysis, if applicable in an embedded environment (C/C++).
ja: 組み込み環境（C/C++）で適用可能であれば、動的リンクと静的リンクの解析

source: Dynamic versus static linking
ja: 動的リンクと静的リンク

source: Dynamic versus static linking .
ja: 動的リンクと静的リンク

source: Dynamic versus static linking (discussed in the following section)
ja: 動的リンクと静的リンク（以下の節で議論されます）

source: Dynamic versus static linking (discussed in the following section) .
ja: 動的リンクと静的リンク（以下の節で議論されます） .

source: EFFECTIVE COMPLIANCE
ja: 効果的なコンプライアンス

source: EFFECTIVE COMPLIANCE The term due diligence refers to a number of concepts involving source code inspection, source code surveillance, or the performance of quality duties and system audits.
ja: 効果的なコンプライアンス 精査（due diligence）という用語は、ソース コード検査、ソース コード監視、品質義務やシステム監査の実行などを含む多くの概念を指しています。

source: EFFECTIVE COMPLIANCE 63
ja: 効果的なコンプライアンス 63

source: ELEMENTS OF AN END-TO-END COMPLIANCE PROCESS
ja: 一貫したコンプライアンス プロセスの要素

source: ELEMENTS OF AN END-TO-END COMPLIANCE PROCESS 64
ja: 一貫したコンプライアンス プロセスの要素 64

source: EMPLOYEE APPRAISAL
ja: 従業員の評価

source: EMPLOYEE APPRAISAL 125
ja: 従業員の評価 125

source: ENFORCEMENT
ja: 守らせること

source: ENGINEERING AND PRODUCT TEAMS
ja: エンジニアリングおよび製品チーム

source: ENGINEERING AND PRODUCT TEAMS 55
ja: エンジニアリングおよび製品チーム 55

source: ENTER OPEN SOURCE COMPLIANCE
ja: オープンソースコン プライアンス手始め
